7_Rails/hinoki/app/controllers/books_controller.rb

INSERT INTO "books" ("user_id", "title", "author", "review", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["title", "No.6"], ["author", "講談社"], ["review", "近未来的で面白かったです"], ["created_at", "2022-08-05 01:32:38.148099"], ["updated_at", "2022-08-05 01:32:38.148099"]]
---
  def create
    @book = current_user.books.build(book_params)
    if @book.save

UPDATE "books" SET "review" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["review", "近未来的で面白かったです。ぜひ読んでみてください。"], ["updated_at", "2022-08-05 01:36:50.358897"], ["id", 1]]
---
  def update
    if @book.update(book_params)