7_Rails/hinoki/app/controllers/sessions_controller.rb

  def login(email, password)
    @user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tomo.k9090@gmail.com"], ["LIMIT", 1]]