7_Rails/momiji/app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE (body LIKE '%Rails%') ORDER BY "blogs"."id" ASC
---
  def index
    keyword = params[:keyword]
    @blogs = Blog.order(:id)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @blog = Blog.find(params[:id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("name", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["title", ""], ["body", ""], ["created_at", "2022-08-03 23:23:54.504806"], ["updated_at", "2022-08-03 23:23:54.504806"]]
---
  def create
    @blog = Blog.new(blog_params)
    if @blog.save()

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "blogs" SET "name" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["name", "くずば"], ["updated_at", "2022-08-03 02:39:24.122460"], ["id", 1]]
---
  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params) #updateが成功した場合