7_Rails/tsubaki/app/controllers/products_controller.rb

  def index
    @products = Product.order(:id)
---
SELECT "products".* FROM "products" ORDER BY "products"."id" ASC

  def create
    @product = Product.new(post_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "昇降デスク"], ["price", 63000], ["created_at", "2022-08-03 06:01:27.529825"], ["updated_at", "2022-08-03 06:01:27.529825"]]

  def update
    @product = Product.find(params[:id])
    if @product.update(post_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", ""], ["price", nil], ["updated_at", "2022-08-03 07:57:18.679355"], ["id", 6]]